#### Terraform Plan 📖 `success`
  <details><summary>Show Plan</summary>

  ```

  aws_s3_bucket.test: Refreshing state... [id=sawada-t4-test]
aws_s3_bucket_public_access_block.test: Refreshing state... [id=sawada-t4-test]
aws_s3_bucket_server_side_encryption_configuration.test: Refreshing state... [id=sawada-t4-test]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket_acl.test will be created
  + resource "aws_s3_bucket_acl" "test" {
      + acl    = "private"
      + bucket = "sawada-t4-test"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan_2023-06-01_16-49-17

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan_2023-06-01_16-49-17"


  ```

  </details>

  *Pushed by: @nektos/act, Action: `workflow_dispatch`*